# SALES PROJECT - BASIC SQL ANALYSIS

# Basic Analysis

In [1]:
%load_ext sql
%sql sqlite:///sales.db

### Total customers

In [2]:
%%sql
SELECT COUNT(*) as total_customers FROM customers

 * sqlite:///sales.db
Done.

[(34,)]

### Total orders

In [3]:
%%sql
SELECT COUNT(*) as total_orders FROM orders

 * sqlite:///sales.db
Done.

[(114,)]

### Total products

In [4]:
%%sql
SELECT COUNT(*) as total_products FROM products

 * sqlite:///sales.db
Done.

[(32,)]

### Total categories

In [5]:
%%sql
SELECT COUNT(DISTINCT category) as total_categories
FROM products

 * sqlite:///sales.db
Done.

[(5,)]

### Total orders per city

In [6]:
%%sql
SELECT 
  c.city,
  COUNT(o.order_id) AS order_count
FROM Orders o
JOIN Customers c ON o.customer_id = c.customer_id
GROUP BY c.city
ORDER BY order_count DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[('Los Angeles', 14),
 ('Virginia', 11),
 ('Phoenix', 9),
 ('Austin', 8),
 ('Unknown', 8),
 ('New York', 6),
 ('Chicago', 5)]

### Genders distribution

In [7]:
%%sql
SELECT gender, COUNT(*) AS count
FROM customers
GROUP BY gender

 * sqlite:///sales.db
Done.

[('F', 15), ('M', 19)]

### Monthly sale distribution

##### order by month

In [8]:
%%sql
SELECT 
  strftime('%Y-%m', order_date) AS month,
  COUNT(*) AS total_orders
FROM Orders
WHERE order_date IS NOT NULL
GROUP BY month
ORDER BY month;

 * sqlite:///sales.db
Done.

[('2024-01', 10),
 ('2024-02', 10),
 ('2024-03', 13),
 ('2024-04', 17),
 ('2024-05', 19),
 ('2024-06', 19),
 ('2024-07', 5),
 ('2024-08', 4),
 ('2024-09', 4),
 ('2024-10', 4),
 ('2024-11', 4),
 ('2024-12', 5)]

##### order by total orders

In [9]:
%%sql
SELECT 
  strftime('%Y-%m', order_date) AS month,
  COUNT(*) AS total_orders
FROM Orders
WHERE order_date IS NOT NULL
GROUP BY month
ORDER BY total_orders DESC;

 * sqlite:///sales.db
Done.

[('2024-05', 19),
 ('2024-06', 19),
 ('2024-04', 17),
 ('2024-03', 13),
 ('2024-01', 10),
 ('2024-02', 10),
 ('2024-07', 5),
 ('2024-12', 5),
 ('2024-08', 4),
 ('2024-09', 4),
 ('2024-10', 4),
 ('2024-11', 4)]

### Most sold products

In [10]:
%%sql
SELECT 
  p.product_name,
  SUM(od.quantity) AS total_quantity_sold
FROM OrderDetails od
JOIN Products p ON od.product_id = p.product_id
GROUP BY p.product_id
ORDER BY total_quantity_sold DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[('Airpods', 17),
 ('Refrigerator', 14),
 ('Air Conditioner', 14),
 ('Running Shoes', 14),
 ('Office Chair', 13),
 ('Electric Kettle', 12),
 ('Hair Dryer', 11)]

### Products total sale

In [11]:
%%sql
SELECT p.product_name, SUM(od.quantity*p.price) AS product_total_sale
FROM products p
JOIN orderdetails od ON od.product_id = p.product_id
GROUP BY p.product_name
ORDER BY product_total_sale DESC
LIMIT 10;

 * sqlite:///sales.db
Done.

[('Smart TV', 9900.0),
 ('Laptop Dell XPS', 8400.0),
 ('Refrigerator', 7000.0),
 ('Dishwasher', 4950.0),
 ('Air Conditioner', 4900.0),
 ('Mountain Bike', 4900.0),
 ('Dining Table', 4800.0),
 ('Smartphone iPhone', 3996.0),
 ('Office Chair', 3900.0),
 ('Airpods', 3400.0)]

### Products average quantity

In [12]:
%%sql
SELECT p.product_name, AVG(od.quantity) as average_quantity
FROM products p
JOIN orderdetails od ON od.product_id = p.product_id
GROUP BY p.product_name
ORDER BY average_quantity DESC
LIMIT 10;

 * sqlite:///sales.db
Done.

[('Microwave Oven', 3.3333333333333335),
 ('Blender', 3.0),
 ('Electric Kettle', 3.0),
 ('Airpods', 2.8333333333333335),
 ('Running Shoes', 2.8),
 ('Dining Table', 2.6666666666666665),
 ('Office Chair', 2.6),
 ('LED Desk Lamp', 2.5),
 ('Wireless Mouse', 2.5),
 ('Air Conditioner', 2.3333333333333335)]

### Products with always 1 quantity

In [13]:
%%sql
SELECT p.product_name, od.quantity as quantity
FROM products p
JOIN orderdetails od ON od.product_id = p.product_id
WHERE od.quantity = 1
GROUP BY p.product_name
LIMIT 10;

 * sqlite:///sales.db
Done.

[('Air Conditioner', 1),
 ('Airpods', 1),
 ('Blender', 1),
 ('Bluetooth Headphones', 1),
 ('Bookshelf', 1),
 ('Coffee Maker', 1),
 ('Cookware Set', 1),
 ('Dining Table', 1),
 ('Dishwasher', 1),
 ('Electric Kettle', 1)]

### Cities with most sold products:
#### ALERT! 'UNKNOWN' label might result in flawed analysis

In [14]:
%%sql
SELECT 
  c.city, COUNT(o.order_id) AS order_count
FROM Orders o
JOIN Customers c ON o.customer_id = c.customer_id
GROUP BY c.city
ORDER BY order_count DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[('Los Angeles', 14),
 ('Virginia', 11),
 ('Phoenix', 9),
 ('Austin', 8),
 ('Unknown', 8),
 ('New York', 6),
 ('Chicago', 5)]

### Customer in each city

In [15]:
%%sql
SELECT city, COUNT(*) as customer_per_city
FROM customers
GROUP BY city
ORDER BY customer_per_city DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[('Los Angeles', 5),
 ('Phoenix', 4),
 ('Virginia', 4),
 ('Austin', 2),
 ('New York', 2),
 ('San Jose', 2),
 ('Unknown', 2)]

### Total orders by each customer

In [16]:
%%sql
SELECT c.customer_id, c.name, COUNT(*) AS orders_by_customer
FROM orders o
JOIN customers c ON c.customer_id = o.customer_id
GROUP BY c.customer_id
ORDER BY orders_by_customer DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[(1, 'John Smith', 5),
 (2, 'Emma Johnson', 5),
 (3, 'Michael Brown', 5),
 (4, 'Olivia Davis', 5),
 (6, 'Sophia Martinez', 5),
 (8, 'Isabella Thomas', 5),
 (9, 'Benjamin Jackson', 5)]

### Total items bought by each customer

In [17]:
%%sql
SELECT c.customer_id, c.name, COUNT(od.product_id) AS total_items_bought
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
JOIN orderdetails od ON od.order_id = o.order_id
GROUP BY c.name, c.customer_id
ORDER BY total_items_bought DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[(2, 'Emma Johnson', 7),
 (18, 'Evelyn Rodriguez', 7),
 (8, 'Isabella Thomas', 7),
 (1, 'John Smith', 7),
 (3, 'Michael Brown', 7),
 (31, 'Elena Gilbert', 6),
 (22, 'James Potter', 6)]

### Total items bought by each customer (quantity included)

In [18]:
%%sql
SELECT c.customer_id, c.name, SUM(od.quantity) AS total_items_bought
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
JOIN orderdetails od ON od.order_id = o.order_id
GROUP BY c.name, c.customer_id
ORDER BY total_items_bought DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[(29, 'Stephen Salvatore', 16),
 (18, 'Evelyn Rodriguez', 14),
 (3, 'Michael Brown', 14),
 (34, 'Adam Adams', 13),
 (12, 'Charlotte Martin', 13),
 (11, 'Elijah Harris', 13),
 (8, 'Isabella Thomas', 12)]

### Total money spent by each customer

In [19]:
%%sql
SELECT c.customer_id, c.name, SUM(od.quantity * p.price) AS total_spent
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
JOIN orderdetails od ON od.order_id = o.order_id
JOIN products p ON od.product_id = p.product_id
GROUP BY c.name, c.customer_id
ORDER BY total_spent DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[(1, 'John Smith', 4540.0),
 (11, 'Elijah Harris', 4520.0),
 (8, 'Isabella Thomas', 4445.0),
 (18, 'Evelyn Rodriguez', 4270.0),
 (34, 'Adam Adams', 3720.0),
 (4, 'Olivia Davis', 3275.0),
 (12, 'Charlotte Martin', 3140.0)]

### Total money spent from each city

In [20]:
%%sql
SELECT c.city, SUM(od.quantity * p.price) AS total_spent
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
JOIN orderdetails od ON od.order_id = o.order_id
JOIN products p ON od.product_id = p.product_id
GROUP BY c.city
ORDER BY total_spent DESC
LIMIT 7;

 * sqlite:///sales.db
Done.

[('Los Angeles', 10574.0),
 ('Virginia', 9235.0),
 ('Phoenix', 7170.0),
 ('San Jose', 5970.0),
 ('Austin', 5240.0),
 ('New York', 5040.0),
 ('San Antonio', 4445.0)]

### Active months for each customer

In [21]:
%%sql
SELECT c.customer_id, c.name, COUNT(DISTINCT STRFTIME('%Y-%m', o.order_date)) as months_active
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.name, c.customer_id
ORDER BY months_active DESC
LIMIT 10;

 * sqlite:///sales.db
Done.

[(2, 'Emma Johnson', 5),
 (14, 'Amelia Garcia', 4),
 (9, 'Benjamin Jackson', 4),
 (12, 'Charlotte Martin', 4),
 (1, 'John Smith', 4),
 (10, 'Mia White', 4),
 (3, 'Michael Brown', 4),
 (6, 'Sophia Martinez', 4),
 (30, 'Damon Salvatore', 3),
 (15, 'Daniel Martinez', 3)]

### Total revenue for each month

#### order by month

In [22]:
%%sql
SELECT STRFTIME('%Y-%m', o.order_date) AS month, SUM(od.quantity * p.price) as total_revenue
FROM orders o
JOIN orderdetails od ON od.order_id = o.order_id
JOIN products p ON od.product_id = p.product_id
GROUP BY month
ORDER BY month;

 * sqlite:///sales.db
Done.

[('2024-01', 6950.0),
 ('2024-02', 7695.0),
 ('2024-03', 10689.0),
 ('2024-04', 9938.0),
 ('2024-05', 12089.0),
 ('2024-06', 7160.0),
 ('2024-07', 3540.0),
 ('2024-08', 4905.0),
 ('2024-09', 3695.0),
 ('2024-10', 1780.0),
 ('2024-11', 4650.0),
 ('2024-12', 1695.0)]

#### order by total revenue

In [23]:
%%sql
SELECT STRFTIME('%Y-%m', o.order_date) AS month, SUM(od.quantity * p.price) as total_revenue
FROM orders o
JOIN orderdetails od ON od.order_id = o.order_id
JOIN products p ON od.product_id = p.product_id
GROUP BY month
ORDER BY total_revenue DESC;

 * sqlite:///sales.db
Done.

[('2024-05', 12089.0),
 ('2024-03', 10689.0),
 ('2024-04', 9938.0),
 ('2024-02', 7695.0),
 ('2024-06', 7160.0),
 ('2024-01', 6950.0),
 ('2024-08', 4905.0),
 ('2024-11', 4650.0),
 ('2024-09', 3695.0),
 ('2024-07', 3540.0),
 ('2024-10', 1780.0),
 ('2024-12', 1695.0)]

### Total items sold in each month

#### order by month

In [24]:
%%sql
SELECT STRFTIME('%Y-%m', o.order_date) AS month, SUM(od.quantity) as total_items
FROM orders o
JOIN orderdetails od ON od.order_id = o.order_id
JOIN products p ON od.product_id = p.product_id
GROUP BY month
ORDER BY month;

 * sqlite:///sales.db
Done.

[('2024-01', 20),
 ('2024-02', 26),
 ('2024-03', 28),
 ('2024-04', 33),
 ('2024-05', 45),
 ('2024-06', 35),
 ('2024-07', 11),
 ('2024-08', 19),
 ('2024-09', 10),
 ('2024-10', 9),
 ('2024-11', 9),
 ('2024-12', 15)]

#### order by total items

In [25]:
%%sql
SELECT STRFTIME('%Y-%m', o.order_date) AS month, SUM(od.quantity) as total_items
FROM orders o
JOIN orderdetails od ON od.order_id = o.order_id
JOIN products p ON od.product_id = p.product_id
GROUP BY month
ORDER BY total_items DESC;

 * sqlite:///sales.db
Done.

[('2024-05', 45),
 ('2024-06', 35),
 ('2024-04', 33),
 ('2024-03', 28),
 ('2024-02', 26),
 ('2024-01', 20),
 ('2024-08', 19),
 ('2024-12', 15),
 ('2024-07', 11),
 ('2024-09', 10),
 ('2024-10', 9),
 ('2024-11', 9)]

### Total distinctive products in each order

In [26]:
%%sql
SELECT o.order_id, COUNT(DISTINCT od.product_id) as total_distinct_items
FROM orders o
JOIN orderdetails od ON od.order_id = o.order_id
GROUP BY o.order_id
ORDER BY total_distinct_items DESC
LIMIT 10;

 * sqlite:///sales.db
Done.

[(104, 5),
 (124, 5),
 (98, 4),
 (109, 4),
 (115, 4),
 (88, 3),
 (1, 2),
 (2, 2),
 (3, 2),
 (21, 2)]

### Most sold caregories (total)

In [27]:
%%sql
SELECT p.category, SUM (od.quantity) AS total_category
FROM products p
JOIN orderdetails od ON od.product_id = p.product_id
GROUP BY p.category
ORDER BY total_category DESC

 * sqlite:///sales.db
Done.

[('Electronics', 85),
 ('Appliances', 83),
 ('Sports', 40),
 ('Furniture', 35),
 ('Kitchen', 34)]

### Most sold categories (revenue)

In [28]:
%%sql
SELECT p.category, SUM (od.quantity * p.price) AS total_category_revenue
FROM products p
JOIN orderdetails od ON od.product_id = p.product_id
GROUP BY p.category
ORDER BY total_category_revenue DESC

 * sqlite:///sales.db
Done.

[('Electronics', 34181.0),
 ('Appliances', 21950.0),
 ('Furniture', 9630.0),
 ('Sports', 7110.0),
 ('Kitchen', 2830.0)]

### Categories most expensive products

In [29]:
%%sql
SELECT category, product_name, MAX(price) as MAX_price
FROM products
GROUP BY category
ORDER BY MAX_price DESC

 * sqlite:///sales.db
Done.

[('Electronics', 'Laptop Dell XPS', 1200.0),
 ('Sports', 'Mountain Bike', 700.0),
 ('Furniture', 'Dining Table', 600.0),
 ('Appliances', 'Dishwasher', 550.0),
 ('Kitchen', 'Cookware Set', 150.0)]

### Categories average price

In [30]:
%%sql
SELECT category, AVG(price) as AVG_price
FROM products
GROUP BY category
ORDER BY AVG_price DESC

 * sqlite:///sales.db
Done.

[('Electronics', 415.3636363636364),
 ('Furniture', 266.25),
 ('Appliances', 248.125),
 ('Sports', 188.0),
 ('Kitchen', 81.25)]